{
  "knowledge_base": {
    "name": "Customer Support Tickets Database",
    "version": "1.0",
    "last_updated": "2025-12-31",
    "tickets": [
      {
        "ticket_id": 45821,
        "subject": "Unable to log in to mobile app",
        "status": "solved",
        "priority": "high",
        "conversation": [
          {
            "author": "customer",
            "message": "I'm unable to log in to the mobile app. It keeps showing 'Invalid credentials', even though I'm entering the correct email and password."
          },
          {
            "author": "agent",
            "message": "Could you please confirm your registered email address and app version? Try force-closing the app and logging in again."
          },
          {
            "author": "customer",
            "message": "Email: adarsh.rawat@email.com, App Version: 3.2.1, Device: Android Samsung Galaxy S21. I've tried force-closing and reinstalling but issue persists."
          },
          {
            "author": "agent",
            "message": "We found multiple failed login attempts which temporarily locked your account. I've unlocked it. Please wait 5 minutes and try again."
          },
          {
            "author": "customer",
            "message": "It's working now. Thank you!"
          }
        ],
        "resolution": "Account was temporarily locked due to multiple failed login attempts. Agent manually unlocked the account.",
        "tags": ["login_issue", "account_locked", "mobile_app"]
      },
      {
        "ticket_id": 45822,
        "subject": "Payment failed but amount deducted",
        "status": "solved",
        "priority": "urgent",
        "conversation": [
          {
            "author": "customer",
            "message": "I tried to make a payment of ₹2,499 through UPI but it failed. However, the amount has been deducted. Transaction ID: TXN789456123."
          },
          {
            "author": "agent",
            "message": "Let me check the transaction status. Could you share a screenshot of the debit message from your bank?"
          },
          {
            "author": "customer",
            "message": "Screenshot attached. Amount deducted at 2:20 PM today."
          },
          {
            "author": "agent",
            "message": "Your transaction was not completed on our end. The amount will be automatically refunded within 5-7 business days. You'll receive a confirmation email."
          }
        ],
        "resolution": "Payment failed on gateway but amount was temporarily held. Refund initiated within 5-7 business days.",
        "tags": ["payment_issue", "refund", "upi"]
      },
      {
        "ticket_id": 45823,
        "subject": "How to update my profile information?",
        "status": "solved",
        "priority": "normal",
        "conversation": [
          {
            "author": "customer",
            "message": "I need to update my phone number and address. How can I do that?"
          },
          {
            "author": "agent",
            "message": "Go to Settings > Profile > Edit Profile > Update your details > Save Changes. Your information will be updated immediately."
          },
          {
            "author": "customer",
            "message": "I don't see the 'Edit Profile' option. Using app version 3.1.5."
          },
          {
            "author": "agent",
            "message": "You're using an older version. Please update to version 3.2.1 from the store. Alternatively, update via our website in Account Settings."
          },
          {
            "author": "customer",
            "message": "Got it! I'll update the app. Thanks!"
          }
        ],
        "resolution": "Customer was using an older app version. Guided to update the app to access Edit Profile feature.",
        "tags": ["profile_update", "app_version"]
      }
    ],
    "common_solutions": {
      "login_issues": {
        "account_locked": "Check for multiple failed login attempts. Manually unlock account. Ask customer to wait 5 minutes before retry.",
        "forgot_password": "Guide customer to use 'Forgot Password' feature. Verify email address. Check spam folder.",
        "invalid_credentials": "Verify email spelling. Check if account exists. Try password reset."
      },
      "payment_issues": {
        "failed_transaction": "Check payment gateway status. Initiate refund if amount deducted. Refund timeline: 5-7 business days.",
        "payment_not_reflecting": "Wait 24 hours for payment to reflect. Check bank statement. Contact payment gateway if issue persists."
      },
      "app_issues": {
        "app_crashing": "Ask for app version and device details. Check for latest version. Known bugs: iOS 17.2 with v3.2.0 (fixed in v3.2.1).",
        "app_not_updating": "Clear app cache. Uninstall and reinstall. Check device storage space."
      }
    }
  }
}